fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентсткоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Минкова - 18.02.2025
	ВКМ_ДобавлениеРеквизитовФормы();
	ВКМ_ВидимостьРеквизитовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
		ВКМ_ВидимостьРеквизитовФормы();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавлениеРеквизитовФормы()
	
	// Минкова - Добавление групп и реквизитов на форму - 18.02.2025
	ГруппаДаты = Элементы.Добавить("ДатыДействияДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаДаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДаты.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДаты.ОтображатьЗаголовок = ЛОЖЬ;
	ГруппаДаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	ПолеВвода = Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаДаты);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ВКМ_ДатаНачалаДействияДоговора");
	
	ПолеВвода = Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаДаты);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ВКМ_ДатаОкончанияДействияДоговора");
	
	ГруппаСтоимость = Элементы.Добавить("СтоимостьДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимость.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтоимость.ОтображатьЗаголовок = ЛОЖЬ;
	ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	
	ПолеВвода = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаСтоимость);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ВКМ_СуммаАбонентскойПлаты");
	
	ПолеВвода = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаСтоимость);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ВКМ_СтоимостьЧасаРаботы");
	
КонецПроцедуры 


&НаСервере
Процедура ВКМ_ВидимостьРеквизитовФормы()
	
	// Минкова - Видимость реквизитов в зависимости от вида договора - 18.02.2025
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентсткоеОбслуживание") Тогда
		Элементы.ДатыДействияДоговора.Видимость = Ложь;
		Элементы.СтоимостьДоговора.Видимость = Ложь;
	Иначе	
		Элементы.ДатыДействияДоговора.Видимость = Истина;
		Элементы.СтоимостьДоговора.Видимость = Истина; 
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
